
	1.	Brand.i for FIS – AI-Powered Branding Compliance (Top 4 Idea):
Developed an automated branding verification system using computer vision (YOLOv8, PyTorch) and web scraping to validate UI elements (logos, buttons, charts) and ensure adherence to FIS branding guidelines. The solution integrates with CI/CD pipelines for automated compliance checks and features a chatbot (OpenAI API) for report interpretation and improvement suggestions. Technologies used include Python, JavaScript, ReactJS, NodeJS, Playwright, and OpenCV. This project was ranked among the top 4 ideas in the competition.
	2.	Inventory Management System:
Built a full-stack web app to streamline inventory, order processing, and customer-supplier interactions. Customers can place, view, and cancel orders, update profiles, and reset passwords. Suppliers manage products, stock, orders, and customer details. Used React.js for the frontend and Node.js/Express/MongoDB for the backend, with JWT authentication and Mailjet for email services. The project improves operational efficiency for both customers and suppliers.
	3.	Playwright Testing and Allure Reports:
Utilized Playwright for comprehensive end-to-end testing of web applications, ensuring seamless integration of frontend and backend functionalities. This involved automating user interactions across multiple browsers (Chromium, WebKit, Firefox) and leveraging Allure Reports for structured test reporting. Allure simplifies test result analysis by providing detailed execution histories and categorizing failures, enhancing debugging efficiency. Applied this approach to various websites and the Inventory Management System, significantly improving test reliability and reducing maintenance overhead.
Developmental Areas:
	1.	Tech Growth:
Continuously explore and adopt advanced tech stacks to enhance development capabilities.
	2.	Leadership & Teamwork:
Focus on developing leadership skills and improving collaboration within team environments to drive project success.
	3.	Time Management:
Improve time management skills to optimize productivity, prioritize tasks effectively, and meet project deadlines efficiently.